grevaillot/svd_tools/headers/STM32F413/rcc.h
/** @defgroup rcc_csr CSR clock control & status register
@{*/

/** RCC_CSR_LPWRRSTF Low-power reset flag **/
#define RCC_CSR_LPWRRSTF		(1 << 31)
/** RCC_CSR_WWDGRSTF Window watchdog reset flag **/
#define RCC_CSR_WWDGRSTF		(1 << 30)
/** RCC_CSR_WDGRSTF Independent watchdog reset flag **/
#define RCC_CSR_WDGRSTF		(1 << 29)
/** RCC_CSR_SFTRSTF Software reset flag **/
#define RCC_CSR_SFTRSTF		(1 << 28)
/** RCC_CSR_PORRSTF POR/PDR reset flag **/
#define RCC_CSR_PORRSTF		(1 << 27)
/** RCC_CSR_PADRSTF PIN reset flag **/
#define RCC_CSR_PADRSTF		(1 << 26)
/** RCC_CSR_BORRSTF BOR reset flag **/
#define RCC_CSR_BORRSTF		(1 << 25)
/** RCC_CSR_RMVF Remove reset flag **/
#define RCC_CSR_RMVF		(1 << 24)
/** RCC_CSR_LSIRDY Internal low-speed oscillator ready **/
#define RCC_CSR_LSIRDY		(1 << 1)
/** RCC_CSR_LSION Internal low-speed oscillator enable **/
#define RCC_CSR_LSION		(1 << 0)

/**@}*/

/** @defgroup rcc_sscgr SSCGR spread spectrum clock generation register
@{*/

/** RCC_SSCGR_SSCGEN Spread spectrum modulation enable **/
#define RCC_SSCGR_SSCGEN		(1 << 31)
/** RCC_SSCGR_SPREADSEL Spread Select **/
#define RCC_SSCGR_SPREADSEL		(1 << 30)

#define RCC_SSCGR_INCSTEP_SHIFT		13
#define RCC_SSCGR_INCSTEP_MASK		0x7fff
/** @defgroup rcc_sscgr_incstep INCSTEP Incrementation step
@{*/
/**@}*/


#define RCC_SSCGR_MODPER_SHIFT		0
#define RCC_SSCGR_MODPER_MASK		0x1fff
/** @defgroup rcc_sscgr_modper MODPER Modulation period
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_plli2scfgr PLLI2SCFGR PLLI2S configuration register
@{*/


#define RCC_PLLI2SCFGR_PLLI2SR_SHIFT		28
#define RCC_PLLI2SCFGR_PLLI2SR_MASK		0x07
/** @defgroup rcc_plli2scfgr_plli2sr PLLI2SR PLLI2S division factor for I2S clocks
@{*/
/**@}*/


#define RCC_PLLI2SCFGR_PLLI2SQ_SHIFT		24
#define RCC_PLLI2SCFGR_PLLI2SQ_MASK		0x0f
/** @defgroup rcc_plli2scfgr_plli2sq PLLI2SQ PLLI2S division factor for USB OTG FS/SDIO/RNG clock
@{*/
/**@}*/

/** RCC_PLLI2SCFGR_PLLI2SSRC PLLI2S entry clock source **/
#define RCC_PLLI2SCFGR_PLLI2SSRC		(1 << 22)

#define RCC_PLLI2SCFGR_PLLI2SN_SHIFT		6
#define RCC_PLLI2SCFGR_PLLI2SN_MASK		0x1ff
/** @defgroup rcc_plli2scfgr_plli2sn PLLI2SN PLLI2S multiplication factor for VCO
@{*/
/**@}*/


#define RCC_PLLI2SCFGR_PLLI2SM_SHIFT		0
#define RCC_PLLI2SCFGR_PLLI2SM_MASK		0x3f
/** @defgroup rcc_plli2scfgr_plli2sm PLLI2SM Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_dckcfgr DCKCFGR Dedicated Clocks Configuration Register
@{*/


#define RCC_DCKCFGR_LPTIMER1SEL_SHIFT		30
#define RCC_DCKCFGR_LPTIMER1SEL_MASK		0x03
/** @defgroup rcc_dckcfgr_lptimer1sel LPTIMER1SEL LPTIMER1 kernel clock selection.
@{*/
/**@}*/


#define RCC_DCKCFGR_I2S2SRC_SHIFT		27
#define RCC_DCKCFGR_I2S2SRC_MASK		0x03
/** @defgroup rcc_dckcfgr_i2s2src I2S2SRC I2S APB2 clocks source selection (I2S1/4/5)
@{*/
/**@}*/


#define RCC_DCKCFGR_I2S1SRC_SHIFT		25
#define RCC_DCKCFGR_I2S1SRC_MASK		0x03
/** @defgroup rcc_dckcfgr_i2s1src I2S1SRC I2S APB1 clocks source selection (I2S2/3)
@{*/
/**@}*/

/** RCC_DCKCFGR_TIMPRE Timers clocks prescalers selection **/
#define RCC_DCKCFGR_TIMPRE		(1 << 24)
/** RCC_DCKCFGR_CKDFSDM1ASEL DFSDM1 audio clock selection. **/
#define RCC_DCKCFGR_CKDFSDM1ASEL		(1 << 15)

/**@}*/

/** @defgroup rcc_ckgatenr CKGATENR RCC clocks gated enable register
@{*/

/** RCC_CKGATENR_EVTCL_CKEN EVTCL_CKEN **/
#define RCC_CKGATENR_EVTCL_CKEN		(1 << 7)
/** RCC_CKGATENR_RCC_CKEN RCC clock enable **/
#define RCC_CKGATENR_RCC_CKEN		(1 << 6)
/** RCC_CKGATENR_FLITF_CKEN Flash Interface clock enable **/
#define RCC_CKGATENR_FLITF_CKEN		(1 << 5)
/** RCC_CKGATENR_SRAM_CKEN SRQAM controller clock enable **/
#define RCC_CKGATENR_SRAM_CKEN		(1 << 4)
/** RCC_CKGATENR_SPARE_CKEN Spare clock enable **/
#define RCC_CKGATENR_SPARE_CKEN		(1 << 3)
/** RCC_CKGATENR_CM4DBG_CKEN Cortex M4 ETM clock enable **/
#define RCC_CKGATENR_CM4DBG_CKEN		(1 << 2)
/** RCC_CKGATENR_AHB2APB2_CKEN AHB to APB2 Bridge clock enable **/
#define RCC_CKGATENR_AHB2APB2_CKEN		(1 << 1)
/** RCC_CKGATENR_AHB2APB1_CKEN AHB to APB1 Bridge clock enable **/
#define RCC_CKGATENR_AHB2APB1_CKEN		(1 << 0)

/**@}*/

/** @defgroup rcc_dckcfgr2 DCKCFGR2 Dedicated Clocks Configuration Register
@{*/

/** RCC_DCKCFGR2_CKSDIOSEL SDIO clock selection. **/
#define RCC_DCKCFGR2_CKSDIOSEL		(1 << 28)
/** RCC_DCKCFGR2_CK48MSEL SDIO/USBFS clock selection. **/
#define RCC_DCKCFGR2_CK48MSEL		(1 << 27)
/** RCC_DCKCFGR2_I2CFMP1SEL I2CFMP1 kernel clock source selection **/
#define RCC_DCKCFGR2_I2CFMP1SEL		(1 << 22)

/**@}*/
